function SecretConnectionsGameWordRouter() {

    this.generateWord = function () {
        var list = [
            "Сладость",
            "Бульон",
            "Виноград",
            "Аромат",
            "Маринад",
            "Печка",
            "Ужин",
            "Постный обед",
            "Канапе",
            "Пряник",
            "Фета",
            "Жареная креветка",
            "Цезарь",
            "Багет",
            "Малина",
            "Песчаный пляж",
            "Путевой чемодан",
            "Активный отдых",
            "Аквапарк",
            "Виза",
            "Остров сокровищ",
            "Перелет",
            "Караван",
            "Золотое яблоко",
            "Марафон",
            "ЗОЖ",
            "Массаж",
            "Утренняя зарядка",
            "Тренинг",
            "Гибкость разума",
            "Сауна",
            "Интернет",
            "Алгоритм успеха",
            "Ядерная энергия",
            "Смартфон",
            "Цифровая лотерея",
            "Танцы",
            "Научная сказка",
            "Вечерние горы",
            "Звездное небо",
            "Золотой песок",
            "Яркий цвет",
            "Теплый свет",
            "Сладкий мед",
            "Шумный город",
            "Тихий вечер",
            "Яркое солнце",
            "Темный лес",
            "Глубокий водопад",
            "Серый камень",
            "Живой оазис",
            "Сухая пустыня",
            "Красный цвет",
            "Дремучий лес",
            "Огромная гора",
            "Мелкий песок",
            "Широкий мост",
            "Веселый смех",
            "Синий океан",
            "Зеленый луг",
            "Свежая роса",
            "Колючий куст",
            "Белый цвет",
            "Медовый месяц",
            "Мягкий пух",
            "Огромный куст",
            "Мокрый камень",
            "Летний ливень",
            "Светлый дом",
            "Быстрый бег",
            "Легкий ветер",
            "Пух",
            "Зеленый холм",
            "Старый город",
            "Сильный ливень",
            "Жаркий песок",
            "Свежий воздух",
            "Прибой",
            "Флигель",
            "Каскад",
            "Форд",
            "Эфир",
            "Бриз",
            "Мозаика",
            "Взлет",
            "Арена",
            "Пирамида",
            "Ботаника",
            "Зеркало",
            "Терраса",
            "Зигзаг",
            "Вальс",
            "Спираль",
            "Фонтан",
            "Лагуна",
            "Купол",
            "Лазурь",
            "Панорама",
            "Визит",
            "Галерея",
            "Шпиль",
            "Вираж",
            "Перелив",
            "Этаж",
            "Терпение",
            "Волна",
            "Арка",
            "Аккорд",
            "Марш",
            "Бифштекс",
            "Аврал",
            "Летучий",
            "Тандем",
            "Брег",
            "Ветвь",
            "Резерв",
            "Грот",
            "Вдох",
            "Прокат",
            "Банкет",
            "Густой",
            "Цветение",
            "Склон",
            "Легенда",
            "Цилиндр",
            "Берег",
            "Стоун",
            "Ландшафт"
        ];
        bridge.shuffle(list);
        var list2 = [];
        var all = 24;
        var med = Math.floor((all - 1) / 3);
        var mark = {
            red: med + 1,
            blue: med,
            die: 1,
            neutral: all - 2 - (med * 2)
        };
        var counter = 0;
        for (var key in mark) {
            for (var i = 0; i < mark[key]; i++) {
                list2.push({
                    "label": list[counter++],
                    "team": key, //red/blue/neutral/die
                    "selected": null //blue/red/null
                });
            }
        }
        bridge.shuffle(list2);
        var data = {};
        for (var i = 0; i < all; i++) {
            data["card" + i] = list2[i];
        }
        data["isGeneratedCard"] = true;
        socketSave(data, bridge.pageArgs["socketUuid"]);
    };
}

bridge.addRouter(new SecretConnectionsGameWordRouter());